# Используйте официальный образ Go в качестве базового образа
FROM golang:1.20.4-alpine

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте файлы go.mod и go.sum и загрузите зависимости
COPY go.mod go.sum ./
RUN go mod download

# Скопируйте остальные файлы проекта в рабочую директорию
COPY . .

# Соберите приложение
RUN go build -o cmd/main .bin/

# Установите порт, на котором будет работать приложение
EXPOSE 8000

# Запустите приложение при запуске контейнера
CMD ["./main"]
